uplinkDecoder:
  fileName: dl-cws.js
  examples:
    - description: Example 1
      input:
        fPort: 1
        bytes: [0x02, 0x46, 0x39, 0x00, 0x03, 0x8a, 0x77, 0x8a, 0x95, 0x97, 0x7a, 0x87, 0x4c, 0x80, 0x47, 0x8a, 0x5e, 0x0b, 0x74]
      output:
        data:
          air_humidity:
            displayName: Air humidity
            unit: '%'
            value: 60.1
          air_temperature:
            displayName: Air temperature
            unit: "\xB0C"
            value: 27.09
          angle:
            displayName: Angle
            unit: "\xB0"
            value: 71
          battery_voltage:
            displayName: Battery voltage
            unit: V
            value: 2.932
          device_id: 17977
          dew_point:
            displayName: Dew point
            unit: "\xB0C"
            value: 18.68
          protocol_version: 2
          sensor_temperature:
            displayName: Sensor temperature
            unit: "\xB0C"
            value: 26.54
          surface_temperature:
            displayName: Surface temperature
            unit: "\xB0C"
            value: 26.79
    - description: Example 2
      input:
        fPort: 1
        bytes: [0x02, 0x46, 0x39, 0x00, 0x02, 0x0b, 0x74]
      output:
        data:
          battery_voltage:
            displayName: Battery voltage
            unit: V
            value: 2.932
          device_id: 17977
          protocol_version: 2

downlinkEncoder:
  fileName: dl-downlink-codec.js
  examples:
    - description: Set period 3600 seconds and save
      input:
        data:
          command: set period + save
          parameter: 3600
      output:
        bytes: [0, 2, 14, 16, 72, 164]
        fPort: 1
    - description: Set ADR off
      input:
        data:
          command: set adr off
      output:
        bytes: [0, 7, 0, 0, 229, 177]
        fPort: 1

downlinkDecoder:
  fileName: dl-downlink-codec.js
  examples:
    - description: Set period 600 seconds
      input:
        fPort: 1
        bytes: [0x00, 0x01, 0x02, 0x58, 0x7E, 0x51]
      output:
        data:
          command: set period
          parameter: 600
    - description: Reset
      input:
        fPort: 1
        bytes: [0xFE, 0xFE, 0x00, 0x00, 0x3C, 0x50]
      output:
        data:
          command: reset
